Revit 2027 API
Alignment.IsValid Method
Overload List
Name | Description
IsValid() |  Checks if this object is a valid alignment.
IsValid(Element) |  Checks if the element is a valid alignment.
Top
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace